<?php
/**
 * Created by PhpStorm.
 * User: Malson
 * Date: 2017/12/1
 * Time: 下午3:27
 */

namespace WeChat;

use WeChat\Exception\WeResultException;
use WeChat\Tools\Http;
use WeChat\Tools\Token;
use WeChat\Tools\Tools;

/**
 * 会员卡类
 *
 * Class Membership
 * @package WeChat
 * @link https://mp.weixin.qq.com/wiki?t=resource/res_main&id=mp1451025283
 */
class Membership extends Base
{

    // +----------------------------------------------------------------------
    // | 定义
    // +----------------------------------------------------------------------

    private $links = [
        // 创建会员卡
        'CREATE' => 'https://api.weixin.qq.com/card/create?' ,
    ];
    // +----------------------------------------------------------------------
    // | 绑定
    // +----------------------------------------------------------------------

    // +----------------------------------------------------------------------
    // | 获取器
    // +----------------------------------------------------------------------

    // +----------------------------------------------------------------------
    // | 方法
    // +----------------------------------------------------------------------


//    public function  (  )
//    {
//
//    }


}